app/controllers/bills_controller.rb

SELECT "bill_payments".* FROM "bill_payments" WHERE "bill_payments"."bill_id" = ?  [["bill_id", 1]]
SELECT "users".* FROM "users" INNER JOIN "user_bills" ON "users"."id" = "user_bills"."user_id" WHERE "user_bills"."bill_id" = ?  [["bill_id", 1]]
---
  def show
    @attendies = @bill.users
    @bill_payments = @bill.bill_payments.includes(:user)

INSERT INTO "bills" ("event", "entry_date", "location", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["event", "lunch"], ["entry_date", 2016-12-09 05:10:00 UTC], ["location", "Mumbai"], ["amount", 100], ["created_at", 2016-12-09 05:11:21 UTC], ["updated_at", 2016-12-09 05:11:21 UTC]]
INSERT INTO "bill_payments" ("user_id", "bill_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["bill_id", 1], ["amount", 50], ["created_at", 2016-12-09 05:22:02 UTC], ["updated_at", 2016-12-09 05:22:02 UTC]]
---
  def create
    @bill = Bill.new(bill_params)

    respond_to do |format|
      begin
        ActiveRecord::Base.transaction do
          if @bill.save
            bill_params[:event_attendes].each do |user_id|
              ub = UserBill.new({bill_id: @bill.id, user_id: user_id})
              ub.save
            end
            bill_params[:bill_contributors].each_with_index do |contributor_id, index|
              bp = BillPayment.new({bill_id: @bill.id, user_id: contributor_id, amount: bill_params[:contributions][index]})
              bp.save