app/controllers/report_controller.rb

SELECT "bills".* FROM "bills"
---
  def index
    @bills = Bill.all